# Ultralytics YOLO-OCR-HighRes
# Optimized for 800x64
# High Resolution (Stride 2), Low Channel Count

# Parameters
nc: 65
end2end: True
reg_max: 16
scale: 's'

# Custom Scale to reduce channel width naturally
# We lower the width_multiple (2nd number) to keep P1/P2 lightweight
scales:
  s: [0.33, 0.25, 1024] 

backbone:
  # [from, repeats, module, args]
  
  # --- P1/2 (Stride 2) ---
  # Keep this standard to grab initial edges
  - [-1, 1, Conv, [64, 3, 2]]    # 0-P1/2 

  # --- P2/4 (Stride 4) ---
  - [-1, 1, Conv, [128, 3, 2]]   # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2

  # --- P3/8 (Stride 8) ---
  # This is now our "Deepest" layer (Context)
  # 64px input / 8 = 8px feature height. Enough for context.
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 2, C3k2, [512, True]]   # 4
  
  # SPPF moved to P3. 
  # This expands receptive field to see surrounding characters.
  - [-1, 1, SPPF, [512, 5]]      # 5 (Deep Context)

head:
  # --- Upsample P3 to P2 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 6
  - [[-1, 2], 1, Concat, [1]] # 7 (Cat Backbone P2)
  - [-1, 2, C3k2, [256, False]] # 8 

  # --- Upsample P2 to P1 (The High Res Layer) ---
  # We are moving into Stride 2 territory here.
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 0], 1, Concat, [1]] # 10 (Cat Backbone P1)
  
  # CRITICAL OPTIMIZATION: 
  # Use a lighter block here or rely on the scale factor (0.25) above 
  # to keep channel count low (likely ~32-64 channels).
  - [-1, 2, C3k2, [128, False]] # 11 (Output Feature Map: Stride 2)

  # --- Detect Head ---
  # Detects at Stride 2.
  # This gives you 2x2 pixel grid cells (vs 4x4 previously).
  - [[11], 1, Detect, [nc]]